In [1]:
import os
os.chdir(r'D:\paper\rowdata')

import pandas as pd
import numpy as np

import sqlite3 as sq3

---

# Basics

新建database:

In [2]:
sqliteConnection = sq3.connect('sql.db')

要在`sql.db`中执行命令，需要创建一个cursor:

In [3]:
cursor = sqliteConnection.cursor()

在python中以str表示SQL query，将其传入cursor.execute()执行  
一次亦可以执行多条query--使用`.executemany()`来实现

In [4]:
query = 'SELECT sqlite_version();'

In [5]:
cursor.execute(query)

使用`cursor.fetchall()`则可以得到命令执行的结果

In [6]:
result = cursor.fetchall()
print(f'SQLite Version is {result}.')

SQLite Version is [('3.38.2',)].

In [7]:
cursor.close()
sqliteConnection.close()

---

# 创建Table

In [15]:
os.chdir(r'D:/paper/rowdata/basics')

basics = pd.read_csv('basics_clean.csv', dtype={'Code':str})
basics

,Code,Industry_1,Industry_2,Estbdt,Listdt,Province,City,Jyxz
0,000002,3,K70,1988-11-01,1991-01-29,440000,440300,P0301
1,000004,2,I65,1986-05-05,1991-01-14,440000,440300,P0306
2,000005,2,N77,1990-02-01,1990-12-10,440000,440300,P0303
3,000006,3,K70,1989-04-01,1992-04-27,440000,440300,P0301
4,000007,3,K70,1988-11-21,1992-04-13,440000,440300,P0306
...,...,...,...,...,...,...,...,...
2971,605580,5,D44,2007-03-05,2021-08-19,330000,330800,P0306
2972,605588,5,C39,2002-01-18,2021-08-12,320000,320100,P0306
2973,605589,5,C26,1994-01-24,2021-08-10,370000,370100,P0306
2974,605598,3,E48,2000-01-28,2021-09-17,310000,310000,P0306
2975,605599,6,F52,1994-12-09,2021-09-09,110000,110000,P0306

In [37]:
for i in range(8):
    basics.iloc[:, i] = basics.iloc[:, i].astype(str)

In [38]:
os.chdir(r'D:/paper/rowdata')
sqlCon = sq3.connect('sql.db')
cursor = sqlCon.cursor()

query = '''
CREATE TABLE test(
Code TEXT, Industry_1 TEXT, Industry_2 TEXT,
Estbdt TEXT, Listdt TEXT, Province TEXT,
City TEXT, Jyxz TEXT, PRIMARY KEY(Code)
);
'''

cursor.execute(query)

sqlCon.commit()

In [39]:
n = len(basics['Code'])

In [40]:
data = [tuple(basics.iloc[i,:]) for i in range(n)]

In [41]:
stmt = '''
INSERT INTO test VALUES(?, ?, ?, ?, ?, ?, ?, ?)
'''

cursor.executemany(stmt, data)

sqlCon.commit()

In [42]:
cursor.close()
sqliteConnection.close()

好的，开始工作